CHT/OF_CCX_CHT_flap/Fluid/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            slip;
    }
    lowerWall
    {
        type            noSlip;
    }
    /*slip-bottom
    {
        type            slip;
    }*/
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
