CHT/OF_CCX_CHT_flap/Fluid/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    flap
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    inlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    outlet
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
//     slip-bottom
//     {
//         type            kqRWallFunction;
//         value           uniform 0.1;
//     }
    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
