CHT/OF_CCX_CHT_flap/Fluid/system/preciceDict.orig.001
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid;

modules (CHT FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           (flap);
    
    readData
    (
      Heat-Flux
    );
    
    writeData
    (
      Temperature
    );
  };
  
  Interface2
  {
    mesh              Fluid-Mesh-Faces;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
    );
    
    writeData
    (
      Forces0
    );
  };
  
  Interface3
  {
    mesh              Fluid-Mesh-Nodes;
    patches           (flap);
    locations         faceNodes;
    
    readData
    (
      Displacements0
    );
    
    writeData
    (
    );
  };
};
